# Требует подключения "common.mk"!

#--------------------------------------------------------------------------------------------------
# File names
#--------------------------------------------------------------------------------------------------

# Имя статической библиотеки (одно на все компоненты).
COMPONENT_KEY_WORD := component

# Шаблоны поиска файлов.
CPP_FILES := $(wildcard ./$(CPP_DIR)/*.cpp)
OBJ_FILES := $(addprefix ./$(OBJ_DIR)/, $(patsubst %.cpp, %.o, $(notdir $(CPP_FILES))))
D_FILES := $(addprefix ./$(D_DIR)/, $(patsubst %.cpp, %.d, $(notdir $(CPP_FILES))))



#--------------------------------------------------------------------------------------------------
# RULES
#--------------------------------------------------------------------------------------------------

# Шаблон создания и обновления результирующего для компонента файла - статической библиотеки.
./%.$(SLIB_EXT): $(OBJ_FILES)
	ar crs $@ $(OBJ_FILES)

# Шаблон создания и обновления объектных файлов.
./$(OBJ_DIR)/%.o: ./$(D_DIR)/%.d | ./$(OBJ_DIR)
	$(COMPILER) $(COMPILER_FLAGS) $(CUR_CPP)

# Шаблон создания и обновление файлов зависимостей.
./$(D_DIR)/%.d: | ./$(D_DIR)
	$(COMPILER) $(COMPILER_FLAGS) $(CUR_CPP) > ./$@



#--------------------------------------------------------------------------------------------------
# CLEAN
#--------------------------------------------------------------------------------------------------

# Полностью очистить директорию с компонетом.
clean_all: clean
	rm -f ./component.$(SLIB_EXT)
